{"config": [{"config": {"batch_input_shape": [null, 784], "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "trainable": true, "units": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "activation": "sigmoid", "name": "dense_1"}, "class_name": "Dense"}, {"config": {"use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 32, "activity_regularizer": null, "bias_regularizer": null, "activation": "sigmoid", "name": "dense_2"}, "class_name": "Dense"}, {"config": {"use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 32, "activity_regularizer": null, "bias_regularizer": null, "activation": "sigmoid", "name": "dense_3"}, "class_name": "Dense"}, {"config": {"use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 10, "activity_regularizer": null, "bias_regularizer": null, "activation": "softmax", "name": "dense_4"}, "class_name": "Dense"}], "keras_version": "2.0.8", "class_name": "Sequential", "backend": "tensorflow"}