{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"units": 8, "dtype": "float32", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "sigmoid", "batch_input_shape": [null, 784], "name": "dense_21", "kernel_regularizer": null, "use_bias": true}}, {"class_name": "Dense", "config": {"units": 32, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "sigmoid", "name": "dense_22", "use_bias": true}}, {"class_name": "Dense", "config": {"units": 10, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "name": "dense_23", "use_bias": true}}], "keras_version": "2.0.8"}